In [1]:
users = {
    "first" : ["Tarokh", "James", "Tommy"],
    "last" : ["Yaghoubi", "Hollands", "White"],
    "email" : ["tarokhgit@gmail.com", "james@gmail.com", "tommy@yahoo.com"]
}

In [2]:
people['first']

['Tarokh', 'James', 'Tommy']

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(users)

In [5]:
df

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com
2   Tommy     White      tommy@yahoo.com

In [6]:
df[['first', 'email']]

    first                email
0  Tarokh  tarokhgit@gmail.com
1   James      james@gmail.com
2   Tommy      tommy@yahoo.com

In [12]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [9]:
df.iloc[[0, 1]]

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com

In [10]:
df

    first      last                email
0  Tarokh  Yaghoubi  tarokhgit@gmail.com
1   James  Hollands      james@gmail.com
2   Tommy     White      tommy@yahoo.com

In [11]:
df.loc[[0, 1], ['first', 'email']]

    first                email
0  Tarokh  tarokhgit@gmail.com
1   James      james@gmail.com

In [26]:
df

   level_0  index                email   first      last
0        0      0  tarokhgit@gmail.com  Tarokh  Yaghoubi
1        1      1      james@gmail.com   James  Hollands
2        2      2      tommy@yahoo.com   Tommy     White

In [17]:
df.set_index('email', inplace=True)

In [22]:
df.loc['tommy@yahoo.com', 'last']

'White'

In [28]:
df.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [29]:
df

   level_0  index                email   first      last
0        0      0  tarokhgit@gmail.com  Tarokh  Yaghoubi
1        1      1      james@gmail.com   James  Hollands
2        2      2      tommy@yahoo.com   Tommy     White